Table of Contents
 Interface IGrpcClient
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
public interface IGrpcClient : IGrpcCommunicator, IGrpcService, IGrpcSender
Inherited Members
 IGrpcCommunicator.Port
 IGrpcCommunicator.Host
 IGrpcCommunicator.StartAsync(string, int)
 IGrpcCommunicator.StopAsync()
 IGrpcService.IsConnected
 IGrpcService.RegisterHandler(string, IGrpcMessageHandler)
 IGrpcService.ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
 IGrpcSender.SendMessageAsync(GrpcMessage)
 Edit this page